In [1]:
!pip install pandas

Requirement already satisfied: pandas in c:\users\ankita singh\anaconda3\lib\site-packages (1.4.4)
Requirement already satisfied: pytz>=2020.1 in c:\users\ankita singh\anaconda3\lib\site-packages (from pandas) (2022.1)
Requirement already satisfied: python-dateutil>=2.8.1 in c:\users\ankita singh\anaconda3\lib\site-packages (from pandas) (2.8.2)
Requirement already satisfied: numpy>=1.18.5 in c:\users\ankita singh\anaconda3\lib\site-packages (from pandas) (1.21.5)
Requirement already satisfied: six>=1.5 in c:\users\ankita singh\anaconda3\lib\site-packages (from python-dateutil>=2.8.1->pandas) (1.16.0)

In [1]:
import pandas as pd
import numpy as np

In [5]:
pd.__version__

'1.4.4'

In [6]:
lis=[1,2,3,4,5]
pd.Series(lis)

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [9]:
arr=np.array(lis)
pd.Series(arr)

0    1
1    2
2    3
3    4
4    5
dtype: int32

In [12]:
pd.Series(index=['eshant','pranjal','jayesh','ashish'],data=[1,2,3,4])

eshant     1
pranjal    2
jayesh     3
ashish     4
dtype: int64

#1)series through dictionary values

In [13]:
steps={'d1':4000,'d2':3000,'d3':5000}
pd.Series(steps)

d1    4000
d2    3000
d3    5000
dtype: int64

# repeat series function

In [15]:
pd.Series(5).repeat(3).reset_index()

   index  0
0      0  5
1      0  5
2      0  5

In [24]:
s=pd.Series([10,20]).repeat([5,2]).reset_index()
s

   index   0
0      0  10
1      0  10
2      0  10
3      0  10
4      0  10
5      1  20
6      1  20

In [30]:
s[2:-1]

   index   0
2      0  10
3      0  10
4      0  10
5      1  20

In [31]:
s.agg([min,max,sum])

     index   0
min      0  10
max      1  20
sum      2  90

In [32]:
#absolute function
sr=pd.Series([1,-2,3,-4,5,-6,7])
sr.abs()

0    1
1    2
2    3
3    4
4    5
5    6
6    7
dtype: int64

In [35]:
#to make index accurate the following can be used:
sr.reset_index(drop=True)

0    1
1   -2
2    3
3   -4
4    5
5   -6
6    7
dtype: int64

In [36]:
type(sr)

pandas.core.series.Series

In [38]:
sr1=sr.astype('float')

0    1.0
1   -2.0
2    3.0
3   -4.0
4    5.0
5   -6.0
6    7.0
dtype: float64

# between function 
gives value between any two functions

In [39]:
sr.between(2,7)

0    False
1    False
2     True
3    False
4     True
5    False
6     True
dtype: bool

# all strings function can be used to extract or modify texts in a series

In [41]:
news=pd.Series(['eht','hyft','jhi'])
print('_'*30)
print(news.str.upper())

______________________________
0     EHT
1    HYFT
2     JHI
dtype: object

In [44]:
for i in news:
    print(i,len(i))

eht 3
hyft 4
jhi 3

In [46]:
#strip function
news=news.str.strip()
news

0     eht
1    hyft
2     jhi
dtype: object

In [49]:
#split function
news.str.split()[0]

['eht']

In [52]:
print(pd.Series(['10/3/1983','10/3/1994','29/10/1998']),str.split('/')[0])

0     10/3/1983
1     10/3/1994
2    29/10/1998
dtype: object /

In [53]:
news.str.split()[0]

['eht']

# STRING FUNCTIONS syntax: seriesname.str.function("condition where it has to be applied")
-upper lower
-strip
-split
-contains
-replace
-count
-endswith
-startwith
-find

In [54]:
#converting a series to list
news.to_list()

['eht', 'hyft', 'jhi']

#PADAS DATAFRAME
are two dimensional frame

In [55]:
l1=["geeks","together","is","portal","for"]
pd.DataFrame(l1)

          0
0     geeks
1  together
2        is
3    portal
4       for

In [56]:
l2=[["t",1],["j",2],["y",3]]
pd.DataFrame(l2)

   0  1
0  t  1
1  j  2
2  y  3

In [58]:
l3={'name':['tom','nick'], "age":[27,34],"address":["loll","iki"]}
t=pd.DataFrame(l3)
t[["name","age"]]

   name age
0   tom  27
1  nick  34

#### loc()
slicing in dataframes using iloc and loc
pandas comprises many methods for its proper functioning. loc() iloc()
used in data filtering using certain conditions

The loc() is label based data selecting method.Name  of the row and column which we want to select.
loc() can accept boolean data unlike iloc()

In [34]:
newdataframe={"name":["ankita","jyoti","jasika"],"age":[23,34,12],"address":["delhi","mumbai","kolkata"]}
df=pd.DataFrame(newdataframe)
df

     name  age  address
0  ankita   23    delhi
1   jyoti   34   mumbai
2  jasika   12  kolkata

In [12]:
df.loc[1:2,'name']

1     jyoti
2    jasika
Name: name, dtype: object

#### basic iloc operation 
index based selection method,we have to pass an inetger to select specific row/column.
it does not include the last element like loc.
iloc()does not accept the boolean data unlike loc()

by using colon we get a set of data and by using comma we  obtain exact row and column which is required

In [13]:
df.iloc[:2,:3]

     name age address
0  ankita  23   delhi
1   jyoti  34  mumbai

In [16]:
df.iloc[[0,1],[0,1]]

     name age
0  ankita  23
1   jyoti  34

In [18]:
df

     name age  address
0  ankita  23    delhi
1   jyoti  34   mumbai
2  jasika  12  kolkata

In [23]:
df["name"]

0    ankita
1     jyoti
2    jasika
Name: name, dtype: object

#### WE CAN ADD COLUMN IN MANY WAYS, FOLLOWING ARE 3 WAYS:
**using list
*using pandas 
*using an existing column(we modify column in the way that we want and that modified part can also be displayed)

In [25]:
#using list
lis1=[22,3,33]
df["hh"]=lis1
df

     name age  address  hh
0  ankita  23    delhi  22
1   jyoti  34   mumbai   3
2  jasika  12  kolkata  33

In [26]:
#using series
t=pd.Series([11,22,33])
df['six']=t
df

     name age  address  hh  six
0  ankita  23    delhi  22   11
1   jyoti  34   mumbai   3   22
2  jasika  12  kolkata  33   33

In [35]:
#using an existing column
df["after10years"]=df["age"]+10
df

     name  age  address  after10years
0  ankita   23    delhi            33
1   jyoti   34   mumbai            44
2  jasika   12  kolkata            22

#### column deletion in data frames
--using del 
--using drop

In [40]:
#del df["address"]
df

     name  after10years
0  ankita            33
1   jyoti            44
2  jasika            22

In [41]:
df.pop("name")
df

   after10years
0            33
1            44
2            22

### addition of rows
in a pandas data frame, we can create a new data frame with the required rows and then just use append on the orginal data frame.

In [3]:

df1=pd.DataFrame([[1,2],[3,4]],columns=["a","b"])
df2=pd.DataFrame([[5,6],[7,8]],columns=["a","b"])
df3=df2.append(df1).reset_index(drop=True)

C:\Users\Ankita Singh\AppData\Local\Temp\ipykernel_12900\3433051970.py:3: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df3=df2.append(df1).reset_index(drop=True)

#### pandas drop function
axis=0 implies row
axis=1 implies coloumn

In [5]:

df3.drop([0,1],axis=0, inplace=True)

In [6]:
df3

   a  b
2  1  2
3  3  4

#### transposing a dataframe
.T can be used to transpose column and rows

In [7]:
data={"one": [1,2,3,4],
     "two":[10,20,30,40],
     "three":[100,200,300,400],
     "four":[1000,2000,3000,4000]}
df5=pd.DataFrame(data)
df5

   one  two  three  four
0    1   10    100  1000
1    2   20    200  2000
2    3   30    300  3000
3    4   40    400  4000

In [10]:
print(df5.T)

          0     1     2     3
one       1     2     3     4
two      10    20    30    40
three   100   200   300   400
four   1000  2000  3000  4000

#### a set of more DataFrame Functionalities

In [11]:
df5

   one  two  three  four
0    1   10    100  1000
1    2   20    200  2000
2    3   30    300  3000
3    4   40    400  4000

In [12]:
# axes function basically returns a list with row label and column label
df5.axes

[RangeIndex(start=0, stop=4, step=1),
 Index(['one', 'two', 'three', 'four'], dtype='object')]

In [13]:
# ndim function: it returns the dimensions of the dataframe
df5.ndim

2

In [17]:
#dtypes attribute in pandas datafrmae returns the data types of the columns in DataFrame.The result is a series with the column names as index and data types of the columns as values
df5.dtypes

one      int64
two      int64
three    int64
four     int64
dtype: object

In [18]:
df5.shape

(4, 4)

In [19]:
#head function
df5.head(2) 
#head function is used to obtain first few rows of a big data set.by

   one  two  three  four
0    1   10    100  1000
1    2   20    200  2000

In [20]:
# tail() function returns last n row, by default it returns last 5 unless mentions. This method is useful for quickly examining the last few rows of a large Data Frame to get a sense of its structure and content
df5.tail(2)

   one  two  three  four
2    3   30    300  3000
3    4   40    400  4000

In [22]:
#empty function(): the empty function returns a bool value indicating whether the Data Frame is empty or not,  Data frame is considered empty of it has no rows
df5.empty

False

#### statistical or mathematical functions
sum
mean median mode variance min max standard deviation

In [23]:
data={"one": [1,2,3,4],
     "two":[10,20,30,40],
     "three":[100,200,300,400],
     "four":[1000,2000,3000,4000]}
dff=pd.DataFrame(data)

In [25]:
dff.sum()

one         10
two        100
three     1000
four     10000
dtype: int64

In [26]:
dff.mean()

one         2.5
two        25.0
three     250.0
four     2500.0
dtype: float64

In [27]:
dff.median()

one         2.5
two        25.0
three     250.0
four     2500.0
dtype: float64

In [37]:
de={"a":[1,2,2,3,4,4,4,5],"b":[10,20,30,40,40,50,60,40]}
newdata=pd.DataFrame(de)
print(newdata["a"].mode())
print(newdata["b"].mode())

0    4
Name: a, dtype: int64
0    40
Name: b, dtype: int64

In [38]:
dff.var()

one      1.666667e+00
two      1.666667e+02
three    1.666667e+04
four     1.666667e+06
dtype: float64

In [39]:
dff.min()

one         1
two        10
three     100
four     1000
dtype: int64

In [40]:
dff.max()

one         4
two        40
three     400
four     4000
dtype: int64

In [42]:
dff.std()

one         1.290994
two        12.909944
three     129.099445
four     1290.994449
dtype: float64

#### describe function
it returns all the central tendency, dispersion and shape of the distribution of a set of numerical data. By default it calculates the central tendency of all numerical columns but if output for a specific row is to be evalutated we can pass as the arguement.

In [43]:
dff.describe()

            one        two       three         four
count  4.000000   4.000000    4.000000     4.000000
mean   2.500000  25.000000  250.000000  2500.000000
std    1.290994  12.909944  129.099445  1290.994449
min    1.000000  10.000000  100.000000  1000.000000
25%    1.750000  17.500000  175.000000  1750.000000
50%    2.500000  25.000000  250.000000  2500.000000
75%    3.250000  32.500000  325.000000  3250.000000
max    4.000000  40.000000  400.000000  4000.000000

#### PIPE FUNCTION
the pipe function works similar to the way apply method works.
The difference is that pipe() allows you to chain multiple operations together by passing the output of one function to the input of the next function.

In [44]:
def add_(i,j):
    return i+j
dff.pipe(add_,10)

   one  two  three  four
0   11   20    110  1010
1   12   30    210  2010
2   13   40    310  3010
3   14   50    410  4010

#### APPLY FUNCTION
is used to apply function to the data frame, either to individual elements or to the entire DataFrame. The function can be either a built in or user defined.

In [45]:
dff

   one  two  three  four
0    1   10    100  1000
1    2   20    200  2000
2    3   30    300  3000
3    4   40    400  4000

In [47]:
dff.apply(np.mean)

one         2.5
two        25.0
three     250.0
four     2500.0
dtype: float64

In [49]:
dff.apply(lambda x: x.max() -x.min())

one         3
two        30
three     300
four     3000
dtype: int64

#### apply map function
map() method is used to apply function to each element of a specific function.
*apply a fucntion to every element of a data frame. It returns the modified data frame.

##### applymap is meant for element wise operations while apply can be used for both element wise and row/coloumn- wise operations

In [50]:
dff.applymap(lambda x: x*100)

   one   two  three    four
0  100  1000  10000  100000
1  200  2000  20000  200000
2  300  3000  30000  300000
3  400  4000  40000  400000

In [52]:
df6=dff.apply(lambda row: row.mean(), axis=0)
df6

one         2.5
two        25.0
three     250.0
four     2500.0
dtype: float64

#### reindex function
the reindex function in pandas is used to change the row labels and/or column labels of a data frame. This function can be used to align data from multiple data frames.
reindexing can be done either along row axis(0)or the coloumn axis (1).

In [13]:
data={'one': [1,2,3,4],
      'two': [10,20,30,40],
      'three':[100,200,300,400],
      'four':[1000,2000,3000,4000]}
        
data1=pd.DataFrame(data)
print(data1)
print('-'*30)
print(data1.reindex([1,2,0,3]))
print('-'*30)
print(data1.reindex(["name","d","f","ff"],axis=0))

   one  two  three  four
0    1   10    100  1000
1    2   20    200  2000
2    3   30    300  3000
3    4   40    400  4000
------------------------------
   one  two  three  four
1    2   20    200  2000
2    3   30    300  3000
0    1   10    100  1000
3    4   40    400  4000
------------------------------
      one  two  three  four
name  NaN  NaN    NaN   NaN
d     NaN  NaN    NaN   NaN
f     NaN  NaN    NaN   NaN
ff    NaN  NaN    NaN   NaN

#### renaming

In [19]:
data1.rename(columns={'one':'three','three':'seven'},inplace=True,index={0:'a',1:'b',2:'c'})
data1

   seven  two  seven  four
a      1   10    100  1000
b      2   20    200  2000
c      3   30    300  3000
3      4   40    400  4000

#### sorting in pandas data frame
pandas provides several methods to sort a DataFrame based on one or more columns.

sort_values:This method sorts the dataframe based on one or more columns. The default sorting order is ascending, but you can change it to descending by passing the ascending argument with a value of false.bash.

In [26]:
data={'one': [100,2,38,4],
      'two': [10,20,30,40],
      'three':[100,200,300,400],
      'four':[1000,2000,3000,4000]}
        
d2=pd.DataFrame(data)

#sorting with respect to specific column
d2.sort_values(by='one',ascending= False)

#sorting based on multiple columns
d2.sort_values(by=['one','two'])

#sorting with specific algoo
#quicksort #mergesort #heapsort
d2.sort_values(by=['one'],kind='heapsort')

   one  two  three  four
1    2   20    200  2000
3    4   40    400  4000
2   38   30    300  3000
0  100   10    100  1000

#### GROUPBY FUNCTION

In [27]:
cricket={'team':['india','india','australia','SA','SA','SA'],'rank':[2,3,4,1,2,3],'year':[2014,2016,2015,2013,2023,2019],'points':[234,876,456,384,484,332]}
d3=pd.DataFrame(cricket)
d3

        team  rank  year  points
0      india     2  2014     234
1      india     3  2016     876
2  australia     4  2015     456
3         SA     1  2013     384
4         SA     2  2023     484
5         SA     3  2019     332

In [30]:
d3.groupby('team').groups

{'SA': [3, 4, 5], 'australia': [2], 'india': [0, 1]}

In [32]:
#to search for specific country with specific year
d3.groupby(['team','year']).get_group(('australia',2015))
#if the data is not present then we will get error

        team  rank  year  points
2  australia     4  2015     456

In [37]:
d3.groupby('team')['points'].sum().sort_values(ascending=False)

team
SA           1200
india        1110
australia     456
Name: points, dtype: int64

In [38]:
groups=d3.groupby('team')
groups['points'].agg([np.sum,np.mean,np.std,np.max,np.min])

            sum   mean         std  amax  amin
team
SA         1200  400.0   77.252832   484   332
australia   456  456.0         NaN   456   456
india      1110  555.0  453.962554   876   234

In [39]:
groups['points'].describe()

           count   mean         std    min    25%    50%    75%    max
team
SA           3.0  400.0   77.252832  332.0  358.0  384.0  434.0  484.0
australia    1.0  456.0         NaN  456.0  456.0  456.0  456.0  456.0
india        2.0  555.0  453.962554  234.0  394.5  555.0  715.5  876.0

In [41]:
d3.groupby('team').filter(lambda x: len(x)==3)

  team  rank  year  points
3   SA     1  2013     384
4   SA     2  2023     484
5   SA     3  2019     332

#### working with csv files and basic data analysis
`a)reading csv`

In [4]:
d4=pd.read_csv('Sample100.csv')
d4.head()

,Serial Number,Company Name,Employee Markme,Description,Leave
0,9788189999599,TALES OF SHIVA,Mark,mark,0
1,9780099578079,1Q84 THE COMPLETE TRILOGY,HARUKI MURAKAMI,Mark,0
2,9780198082897,MY KUMAN,Mark,Mark,0
3,9780007880331,THE GOD OF SMAAL THINGS,ARUNDHATI ROY,4TH HARPER COLLINS,2
4,9780545060455,THE BLACK CIRCLE,Mark,4TH HARPER COLLINS,0

#### Pandas info function
Pandas dataframe.info() function is used to get a concise summary of the dataframe. It comes really handy when doing exploratory analysis of the data. To get a quick overview of the data set we can used info function.

In [46]:
#pandas info function :

d4.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 99 entries, 0 to 98
Data columns (total 5 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Serial Number    99 non-null     int64
 1   Company Name     99 non-null     object
 2   Employee Markme  97 non-null     object
 3   Description      99 non-null     object
 4   Leave            99 non-null     int64
dtypes: int64(2), object(3)
memory usage: 4.0+ KB

#### isnull() function to check if there are null values present

In [48]:
d4.isnull()

    Serial Number  Company Name  Employee Markme  Description  Leave
0           False         False            False        False  False
1           False         False            False        False  False
2           False         False            False        False  False
3           False         False            False        False  False
4           False         False            False        False  False
..            ...           ...              ...          ...    ...
94          False         False            False        False  False
95          False         False            False        False  False
96          False         False            False        False  False
97          False         False            False        False  False
98          False         False            False        False  False

[99 rows x 5 columns]

In [49]:
d4.describe(percentiles=[0.80])

       Serial Number      Leave
count   9.900000e+01  99.000000
mean    9.687307e+12   0.818182
std     9.827211e+11   2.158815
min     8.187776e+09   0.000000
50%     9.788185e+12   0.000000
80%     9.789383e+12   1.000000
max     9.789386e+12  10.000000

In [51]:
t=d4['Leave'].quantile(.80)
t

1.0

#### COPY FUNCTION
* if if normally just use de=df , for getting a copy of data frame, then anychange that we make to the de will be updated on df as well so inorder to avoid that we use copy function.

* copy function creates a entire new data frame.

In [52]:
de=d4.copy()

In [54]:
[d4['Leave']+100]

[0     100
 1     100
 2     100
 3     102
 4     100
      ...
 94    100
 95    100
 96    100
 97    100
 98    100
 Name: Leave, Length: 99, dtype: int64]

In [56]:
de['Leave + 100']=de['Leave']+100
print(de)

    Serial Number                   Company Name  Employee Markme  \
0   9788189999599                 TALES OF SHIVA             Mark
1   9780099578079      1Q84 THE COMPLETE TRILOGY  HARUKI MURAKAMI
2   9780198082897                       MY KUMAN             Mark
3   9780007880331        THE GOD OF SMAAL THINGS    ARUNDHATI ROY
4   9780545060455               THE BLACK CIRCLE             Mark
..            ...                            ...              ...
94  9788184821536  MORE STORIES FROM THE JATAKAS             Mark
95  9788184821543           MORE TALES OF BIRBAL                -
96  9788184821550         TALES FROM THE JATAKAS                -
97  9788184821567               RAMarkS OF MEWAR                -
98  9788184821574       THE SONS OF THE PANDAVAS                -

           Description  Leave  Leave + 100
0                 mark      0          100
1                 Mark      0          100
2                 Mark      0          100
3   4TH HARPER COLLINS      2          102
4   4TH HARPER COLLINS      0          100
..                 ...    ...          ...
94                 ACK      0          100
95                 ACK      0          100
96                 ACK      0          100
97                 ACK      0          100
98                 ACK      0          100

[99 rows x 6 columns]

#### unique and nunique
* unique() : to see unique values in a particular column
* nunique(): is used to count number of unique values in particular column

In [5]:
d4['Leave'].unique()

array([ 0,  2,  1,  4, 10,  5], dtype=int64)

#### dropna() function

sometimes csv file has null values, which are later displayed as NaN in DataFrame.Pandas dropna() method allows the user to analyze and drop rows and columns with null values.

In [6]:
d4.isnull().sum()

Serial Number      0
Company Name       0
Employee Markme    2
Description        0
Leave              0
dtype: int64

In [11]:
d5=d4.dropna(inplace= True, axis=1)
print(d5)

None

In [13]:
d4.isnull().sum()

Serial Number      0
Company Name       0
Employee Markme    0
Description        0
Leave              0
dtype: int64

#### FILLNA FUNCTION 
FILLNA() is used to fill in null spaces.

In [17]:
mis=round(d4['Leave'].mean(),2)
d4['Leave'].fillna(mis)
d4

,Serial Number,Company Name,Employee Markme,Description,Leave
0,9788189999599,TALES OF SHIVA,Mark,mark,0
1,9780099578079,1Q84 THE COMPLETE TRILOGY,HARUKI MURAKAMI,Mark,0
2,9780198082897,MY KUMAN,Mark,Mark,0
3,9780007880331,THE GOD OF SMAAL THINGS,ARUNDHATI ROY,4TH HARPER COLLINS,2
4,9780545060455,THE BLACK CIRCLE,Mark,4TH HARPER COLLINS,0
...,...,...,...,...,...
94,9788184821536,MORE STORIES FROM THE JATAKAS,Mark,ACK,0
95,9788184821543,MORE TALES OF BIRBAL,-,ACK,0
96,9788184821550,TALES FROM THE JATAKAS,-,ACK,0
97,9788184821567,RAMarkS OF MEWAR,-,ACK,0
98,9788184821574,THE SONS OF THE PANDAVAS,-,ACK,0

#### sample function
it is used to generate a sample random row or coloumn from the function caller data frame.
#### to_csv() function
pandas series. to csv() function write the given oj=bject to a comma separated values (csv) file/format

syntax

* data
* df=pd.DataFrame(data)
* df.to_csv('Number.csv')

we get an extra column of index
in order to avoid that we can give the followig command
* df.to_csv('Number.csv',index= False)

### A detailed Pandas Profile Report

the pandas_profiling library in python include a method named as ProfileReport() which generates a basic report on he input DataFrame. The report consists:
DataFrame overview, Each attribute on which DataFrame is defined, Correlations between attributes( pearson correlation and Spearman Correlation), and A sample of Data Frame

In [4]:
!pip install pandas_profiling
import matplotlib
import pandas_profiling as pp

Collecting pandas_profiling
  Downloading pandas_profiling-3.6.6-py2.py3-none-any.whl (324 kB)
     ------------------------------------ 324.4/324.4 kB 304.7 kB/s eta 0:00:00
Collecting ydata-profiling
  Downloading ydata_profiling-4.5.0-py2.py3-none-any.whl (357 kB)
     ------------------------------------ 357.4/357.4 kB 277.8 kB/s eta 0:00:00
Collecting phik<0.13,>=0.11.1
  Downloading phik-0.12.3-cp39-cp39-win_amd64.whl (663 kB)
     ------------------------------------ 663.5/663.5 kB 398.1 kB/s eta 0:00:00
Collecting typeguard<3,>=2.13.2
  Downloading typeguard-2.13.3-py3-none-any.whl (17 kB)
Requirement already satisfied: tqdm<5,>=4.48.2 in c:\users\ankita singh\anaconda3\lib\site-packages (from ydata-profiling->pandas_profiling) (4.64.1)
Collecting dacite>=1.8
  Downloading dacite-1.8.1-py3-none-any.whl (14 kB)
Requirement already satisfied: pandas!=1.4.0,<2.1,>1.1 in c:\users\ankita singh\anaconda3\lib\site-packages (from ydata-profiling->pandas_profiling) (1.4.4)
Collecting wordcloud>=1.9.1
  Downloading wordcloud-1.9.2-cp39-cp39-win_amd64.whl (153 kB)
     ------------------------------------ 153.3/153.3 kB 436.1 kB/s eta 0:00:00
Collecting imagehash==4.3.1
  Downloading ImageHash-4.3.1-py2.py3-none-any.whl (296 kB)
     ------------------------------------ 296.5/296.5 kB 398.2 kB/s eta 0:00:00
Requirement already satisfied: jinja2<3.2,>=2.11.1 in c:\users\ankita singh\anaconda3\lib\site-packages (from ydata-profiling->pandas_profiling) (2.11.3)
Requirement already satisfied: statsmodels<1,>=0.13.2 in c:\users\ankita singh\anaconda3\lib\site-packages (from ydata-profiling->pandas_profiling) (0.13.2)
Collecting multimethod<2,>=1.4
  Downloading multimethod-1.9.1-py3-none-any.whl (10 kB)
Requirement already satisfied: requests<3,>=2.24.0 in c:\users\ankita singh\anaconda3\lib\site-packages (from ydata-profiling->pandas_profiling) (2.28.1)
Requirement already satisfied: matplotlib<4,>=3.2 in c:\users\ankita singh\anaconda3\lib\site-packages (from ydata-profiling->pandas_profiling) (3.5.2)
Collecting pydantic<2,>=1.8.1
  Downloading pydantic-1.10.12-cp39-cp39-win_amd64.whl (2.2 MB)
     ---------------------------------------- 2.2/2.2 MB 406.5 kB/s eta 0:00:00
Requirement already satisfied: scipy<1.12,>=1.4.1 in c:\users\ankita singh\anaconda3\lib\site-packages (from ydata-profiling->pandas_profiling) (1.9.1)
Requirement already satisfied: PyYAML<6.1,>=5.0.0 in c:\users\ankita singh\anaconda3\lib\site-packages (from ydata-profiling->pandas_profiling) (6.0)
Collecting visions[type_image_path]==0.7.5
  Downloading visions-0.7.5-py3-none-any.whl (102 kB)
     ------------------------------------ 102.7/102.7 kB 739.5 kB/s eta 0:00:00
Requirement already satisfied: numpy<1.24,>=1.16.0 in c:\users\ankita singh\anaconda3\lib\site-packages (from ydata-profiling->pandas_profiling) (1.21.5)
Collecting htmlmin==0.1.12
  Downloading htmlmin-0.1.12.tar.gz (19 kB)
  Preparing metadata (setup.py): started
  Preparing metadata (setup.py): finished with status 'done'
Requirement already satisfied: seaborn<0.13,>=0.10.1 in c:\users\ankita singh\anaconda3\lib\site-packages (from ydata-profiling->pandas_profiling) (0.11.2)
Requirement already satisfied: pillow in c:\users\ankita singh\anaconda3\lib\site-packages (from imagehash==4.3.1->ydata-profiling->pandas_profiling) (9.2.0)
Requirement already satisfied: PyWavelets in c:\users\ankita singh\anaconda3\lib\site-packages (from imagehash==4.3.1->ydata-profiling->pandas_profiling) (1.3.0)
Collecting tangled-up-in-unicode>=0.0.4
  Downloading tangled_up_in_unicode-0.2.0-py3-none-any.whl (4.7 MB)
     ---------------------------------------- 4.7/4.7 MB 832.3 kB/s eta 0:00:00
Requirement already satisfied: attrs>=19.3.0 in c:\users\ankita singh\anaconda3\lib\site-packages (from visions[type_image_path]==0.7.5->ydata-profiling->pandas_profiling) (21.4.0)
Requirement already satisfied: networkx>=2.4 in c:\users\ankita singh\anaconda3\lib\site-packages (from visions[type_image_path]==0.7.5->ydata-profiling->pandas_profiling) (2.8.4)
Requirement already satisfied: MarkupSafe>=0.23 in c:\users\ankita singh\anaconda3\lib\site-packages (from jinja2<3.2,>=2.11.1->ydata-profiling->pandas_profiling) (2.0.1)
Requirement already satisfied: python-dateutil>=2.7 in c:\users\ankita singh\anaconda3\lib\site-packages (from matplotlib<4,>=3.2->ydata-profiling->pandas_profiling) (2.8.2)
Requirement already satisfied: packaging>=20.0 in c:\users\ankita singh\anaconda3\lib\site-packages (from matplotlib<4,>=3.2->ydata-profiling->pandas_profiling) (21.3)
Requirement already satisfied: fonttools>=4.22.0 in c:\users\ankita singh\anaconda3\lib\site-packages (from matplotlib<4,>=3.2->ydata-profiling->pandas_profiling) (4.25.0)
Requirement already satisfied: pyparsing>=2.2.1 in c:\users\ankita singh\anaconda3\lib\site-packages (from matplotlib<4,>=3.2->ydata-profiling->pandas_profiling) (3.0.9)
Requirement already satisfied: cycler>=0.10 in c:\users\ankita singh\anaconda3\lib\site-packages (from matplotlib<4,>=3.2->ydata-profiling->pandas_profiling) (0.11.0)
Requirement already satisfied: kiwisolver>=1.0.1 in c:\users\ankita singh\anaconda3\lib\site-packages (from matplotlib<4,>=3.2->ydata-profiling->pandas_profiling) (1.4.2)
Requirement already satisfied: pytz>=2020.1 in c:\users\ankita singh\anaconda3\lib\site-packages (from pandas!=1.4.0,<2.1,>1.1->ydata-profiling->pandas_profiling) (2022.1)
Requirement already satisfied: joblib>=0.14.1 in c:\users\ankita singh\anaconda3\lib\site-packages (from phik<0.13,>=0.11.1->ydata-profiling->pandas_profiling) (1.1.0)
Requirement already satisfied: typing-extensions>=4.2.0 in c:\users\ankita singh\anaconda3\lib\site-packages (from pydantic<2,>=1.8.1->ydata-profiling->pandas_profiling) (4.3.0)
Requirement already satisfied: idna<4,>=2.5 in c:\users\ankita singh\anaconda3\lib\site-packages (from requests<3,>=2.24.0->ydata-profiling->pandas_profiling) (3.3)
Requirement already satisfied: urllib3<1.27,>=1.21.1 in c:\users\ankita singh\anaconda3\lib\site-packages (from requests<3,>=2.24.0->ydata-profiling->pandas_profiling) (1.26.11)
Requirement already satisfied: certifi>=2017.4.17 in c:\users\ankita singh\anaconda3\lib\site-packages (from requests<3,>=2.24.0->ydata-profiling->pandas_profiling) (2022.9.14)
Requirement already satisfied: charset-normalizer<3,>=2 in c:\users\ankita singh\anaconda3\lib\site-packages (from requests<3,>=2.24.0->ydata-profiling->pandas_profiling) (2.0.4)
Requirement already satisfied: patsy>=0.5.2 in c:\users\ankita singh\anaconda3\lib\site-packages (from statsmodels<1,>=0.13.2->ydata-profiling->pandas_profiling) (0.5.2)
Requirement already satisfied: colorama in c:\users\ankita singh\anaconda3\lib\site-packages (from tqdm<5,>=4.48.2->ydata-profiling->pandas_profiling) (0.4.5)
Requirement already satisfied: six in c:\users\ankita singh\anaconda3\lib\site-packages (from patsy>=0.5.2->statsmodels<1,>=0.13.2->ydata-profiling->pandas_profiling) (1.16.0)
Building wheels for collected packages: htmlmin
  Building wheel for htmlmin (setup.py): started
  Building wheel for htmlmin (setup.py): finished with status 'done'
  Created wheel for htmlmin: filename=htmlmin-0.1.12-py3-none-any.whl size=27082 sha256=a40b08d6295a8d8a15e964e6f184de30470a6923b4b5f4a25630d113c575ba88
  Stored in directory: c:\users\ankita singh\appdata\local\pip\cache\wheels\1d\05\04\c6d7d3b66539d9e659ac6dfe81e2d0fd4c1a8316cc5a403300
Successfully built htmlmin
Installing collected packages: htmlmin, typeguard, tangled-up-in-unicode, pydantic, multimethod, dacite, imagehash, wordcloud, visions, phik, ydata-profiling, pandas_profiling
Successfully installed dacite-1.8.1 htmlmin-0.1.12 imagehash-4.3.1 multimethod-1.9.1 pandas_profiling-3.6.6 phik-0.12.3 pydantic-1.10.12 tangled-up-in-unicode-0.2.0 typeguard-2.13.3 visions-0.7.5 wordcloud-1.9.2 ydata-profiling-4.5.0

C:\Users\Ankita Singh\AppData\Local\Temp\ipykernel_15484\20217425.py:3: DeprecationWarning: `import pandas_profiling` is going to be deprecated by April 1st. Please use `import ydata_profiling` instead.
  import pandas_profiling as pp